; domain
;Header and description

(define (domain clean-robot)

;import needed requirements
(:requirements :strips :negative-preconditions :typing)

;define types box and robot just for simplicity
(:types box - movable robot - movable office)

; There is always only one robot so it can be 
; defined as a constant
(:constants R - robot)

(:predicates
 (at ?B - movable ?o - office) ; The object B is at office o
 (adj ?o1 ?o2 - office) ; The offices o1 and o2 are adjacent
 (dirty ?o - office) ; The office o is dirty
 (empty ?o - office) ; There is no box at office o
)

(:action clean
    :parameters (?o - office)
    :precondition (and (at R ?o) ; The robot is at office o
                       (dirty ?o) ; The office o is dirty
                    )
    :effect (and (not (dirty ?o)) ; The office o is not dirty anymore
            )
)

(:action move
    :parameters (?o1 ?o2 - office)
    :precondition (and (adj ?o1 ?o2) ; Both offices are adjacent
                        (at R ?o1) ; The robot is at office o1
                   )
    :effect (and (not (at R ?o1)) ; The robot is not at office o1 anymore
                 (at R ?o2) ; The robot is now at office o2
            )
)

(:action push
    :parameters (?B - box ?o1 ?o2 - office)
    :precondition (and (at R ?o1) ; The robot is at office o1
                       (adj ?o1 ?o2) ; Both offices are adjacent
                       (at ?B ?o1) (empty ?o2) ; The box B is at o1 and o2 is empty
                   )
    :effect (and (at R ?o2) (not (at R ?o1)) ; Move the robot to o2
                 (at ?B ?o2) (not (at ?B ?o1)) ; Move the box to o2
                 (not (empty ?o2)) (empty ?o1) ; o2 is not empty anymore and o1 is empty
            )
)



;define actions here

)

; problem
(define (problem NCELL4) (:domain clean-robot)
(:objects
    o1 o2 o3 o4 - office ; Offices
    A B - box ; Boxes
)

(:init

 ; Adjacency conditions
 (adj o1 o2) (adj o2 o1)
 (adj o1 o3) (adj o3 o1)

 (adj o2 o4) (adj o4 o2)

 (adj o3 o4) (adj o4 o3)
 
 ; Robot initial location
 (at R o3)

 ; Box initial location
 (at A o1) (empty o2)
 (empty o3) (at B o4)

 ; Dirty offices
 (dirty o2)
 (dirty o3)

)

(:goal (and
    ; Robot final location
    (at R o4)

    ; Clean offices
    (not (dirty o2))

    ; Box final location
    (at A o2) (at B o1)
))
)

; plan
1. (move o3 o1)
   deleted: (at r o3)
   added: (at r o1)
   goals met: 0 of 4
2. (push a o1 o2)
   deleted: (at r o1) (at a o1) (empty o2)
   added: (at r o2) (at a o2) (empty o1)
   goals met: 1 of 4
3. (clean o2)
   deleted: (dirty o2)
   goals met: 2 of 4
4. (move o2 o4)
   deleted: (at r o2)
   added: (at r o4)
   goals met: 3 of 4
5. (push b o4 o3)
   deleted: (at r o4) (at b o4) (empty o3)
   added: (at r o3) (at b o3) (empty o4)
   goals met: 2 of 4
6. (push b o3 o1)
   deleted: (at r o3) (at b o3) (empty o1)
   added: (at r o1) (at b o1) (empty o3)
   goals met: 3 of 4
7. (move o1 o2)
   deleted: (at r o1)
   added: (at r o2)
   goals met: 3 of 4
8. (move o2 o4)
   deleted: (at r o2)
   added: (at r o4)
   goals met: 4 of 4
